--------------------------------------------------------------------------------
-- UNION
-- : 결과물 또는 레코드를 합치는 작업
-- : 동일한 내용이 있는 경우 중복을 제거하고 하나만 남긴다.
-- UNION의 종류: UNION, MINUS, INTERSECT, UNION ALL
-- (JOIN은 컬럼을 합치는 작업으로 UNION과는 완전히 다르다)
-- ex> 세 종류의 게시판을 합쳐서 통합 검색을 하는 경우에 사용 가능
--------------------------------------------------------------------------------
SELECT id, name FROM member
UNION
SELECT writer_id, title FROM notice;


--------------------------------------------------------------------------------
-- UNION ALL: 중복된 내용도 모두 포함하여 출력
--------------------------------------------------------------------------------
SELECT id, name FROM member
UNION ALL
SELECT writer_id, title FROM notice;


--------------------------------------------------------------------------------
-- MINUS: 메인 테이블에서 두 테이블 간의 중복된 내용을 제외하고 출력
--------------------------------------------------------------------------------
SELECT id, name FROM member
MINUS
SELECT writer_id, title FROM notice;


--------------------------------------------------------------------------------
-- INTERSECT: 두 테이블 간 중복된 내용만 출력
--------------------------------------------------------------------------------
SELECT id, name FROM member
INTERSECT
SELECT writer_id, title FROM notice;


--------------------------------------------------------------------------------
-- 동일한 하나의 테이블로도 가능
--------------------------------------------------------------------------------
SELECT id, name FROM member
MINUS
SELECT id, name FROM member
WHERE name LIKE '임%';







