--------------------------------------------------------------------------------
-- 서브쿼리: 구절의 순서를 바꿔야 하는 경우
--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
-- 최신 등록순으로 정렬한 결과에서 상위 다섯명을 원하는 경우
--------------------------------------------------------------------------------
SELECT * FROM notice WHERE ROWNUM BETWEEN 1 AND 5;

-- 1. 정렬
SELECT * FROM member ORDER BY regdate DESC;

-- 2. 정렬한 내용을 FROM절에 대입하여 이중 쿼리문을 작성 
SELECT *
FROM ( SELECT * FROM member ORDER BY regdate DESC )
WHERE ROWNUM BETWEEN 1 AND 5;

--------------------------------------------------------------------------------
-- 나이가 평균나이 이상인 회원을 출력
--------------------------------------------------------------------------------
-- 1. 평균 
SELECT AVG(age) FROM member;

-- 2. 평균을 WHERE절에 대입하여 이중 쿼리문 작성
SELECT * FROM member 
WHERE age > ( SELECT AVG(age) FROM member );


commit;

