--------------------------------------------------------------------------------
-- JOIN
-- 참조관계에 있는 테이블을 합치는 작업
-- INNER JOIN, OUTER JOIN, SELF JOIN, CROSS JOIN(Cartesian Product)
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
-- SELF JOIN
-- 하나의 테이블 내 데이터가 서로 포함 관계를 가지는 경우
-- SELF JOIN도 OUTER JOIN으로 사용하는 것이 일반적이다.
-- (테이블이 자기 테이블을 참조한다)
--------------------------------------------------------------------------------
 
SELECT m.*, b.name boss_name 
FROM member m LEFT OUTER JOIN member b ON b.id = m.boss_id; 
